tap "wox-launcher/wox"

# Core tools
brew "asdf"
brew "chezmoi"
brew "git"
brew "zsh"

# CLI utilities
brew "jq"
brew "yazi"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "eza"
brew "bat"
brew "ffmpeg"
brew "sevenzip"
brew "tree"

# Development
brew "gh"              # GitHub CLI

# Erlang build dependencies (needed for asdf erlang)
brew "autoconf"
brew "openssl@3"
brew "wxwidgets"
brew "libxslt"
brew "fop"

# Apps
cask "claude-code"
cask "font-symbols-only-nerd-font"
cask "wezterm"
cask "karabiner-elements"
